> ### Note on Labs and Assignments:
>
> üîß Look for the **wrench emoji** üîß ‚Äî it highlights where you're expected to take action!
>
> These sections are graded and are not optional.
>

# IS 4487 Lab 4: Data Understanding

## Outline

- Load and preview a real-world dataset
- Inspect structure and identify missing or unusual data
- Perform basic grouped summaries

<a href="https://colab.research.google.com/github/Stan-Pugsley/is_4487_base/blob/main/Labs/lab_04_data_understanding.ipynb" target="_parent">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

## Dataset Overview

We will be using a San Francisco rental unit dataset.  Some rentals are apartments, others are for homes, and there may be some other random properties for rent.  Each row represents one rental listing.

**Dataset:** `rent.csv`  
Source: [TidyTuesday ‚Äì 2022-07-05](https://github.com/rfordatascience/tidytuesday/blob/main/data/2022/2022-07-05/rent.csv)

| Variable       | Type       | Description |
|----------------|------------|-------------|
| `post_id`      | Categorical| Unique listing ID |
| `date`         | Numeric    | Listing date (numeric format) |
| `year`         | Integer    | Year of listing |
| `nhood`        | Categorical| Neighborhood |
| `city`         | Categorical| City |
| `county`       | Categorical| County |
| `price`        | Numeric    | Listing price (USD) |
| `beds`         | Numeric    | Number of bedrooms |
| `baths`        | Numeric    | Number of bathrooms |
| `sqft`         | Numeric    | Square footage |
| `room_in_apt`  | Binary     |  Indicates whether the rental listing is for an entire apartment (0) or a single room within an apartment (1). |
| `address`      | Categorical| Street address |
| `lat`          | Numeric    | Latitude |
| `lon`          | Numeric    | Longitude |
| `title`        | Text       | Listing title |
| `descr`        | Text       | Listing description |
| `details`      | Text       | Additional details |

## Part 1: Importing the Data

### Instructions:
- Import the `pandas` library.
- Import data from the rent.csv into a dataframe from the tidytuesday link.
- Use `.info()` and `.head()` to inspect the structure and preview the data.

### Note on importing data:
- In this lab we will be importing data from a website, rather than a Python library
- A "CSV" file is a text file that has commma separated values.  You can open the file in Excel, Pandas, or in a notepad on your laptop.
- GitHub can host text files as well as code.  In this case we are pulling the data directly from GitHub into a dataframe.

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/rfordatascience/tidytuesday/main/data/2022/2022-07-05/rent.csv'
df = pd.read_csv(url)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200796 entries, 0 to 200795
Data columns (total 17 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   post_id      200796 non-null  object
 1   date         200796 non-null  int64
 2   year         200796 non-null  int64
 3   nhood        200796 non-null  object
 4   city         200796 non-null  object
 5   county       199402 non-null  object
 6   price        200796 non-null  int64
 7   beds         194188 non-null  float64
 8   baths        42675 non-null   float64
 9   sqft         64679 non-null   float64
 10  room_in_apt  200796 non-null  int64
 11  address      3908 non-null    object
 12  lat          7651 non-null    float64
 13  lon          4312 non-null    float64
 14  title        198279 non-null  object
 15  descr        3254 non-null    object
 16  details      8016 non-null    object
dtypes: float64(5), int64(4), object(8)
memory usage: 26.0+ MB

In [2]:
df.head()

,post_id,date,year,nhood,city,county,price,beds,baths,sqft,room_in_apt,address,lat,lon,title,descr,details
0,pre2013_134138,20050111,2005,alameda,alameda,alameda,1250,2.0,2.0,NaN,0,NaN,NaN,NaN,$1250 / 2br - 2BR/2BA 1145 ALAMEDA DE LAS PU...,NaN,NaN
1,pre2013_135669,20050126,2005,alameda,alameda,alameda,1295,2.0,NaN,NaN,0,NaN,NaN,NaN,$1295 / 2br - Walk the Beach! 1 FREE MONTH + $...,NaN,NaN
2,pre2013_127127,20041017,2004,alameda,alameda,alameda,1100,2.0,NaN,NaN,0,NaN,NaN,NaN,$1100 / 2br - cottage,NaN,NaN
3,pre2013_68671,20120601,2012,alameda,alameda,alameda,1425,1.0,NaN,735.0,0,NaN,NaN,NaN,$1425 / 1br - 735ft¬≤ - BEST LOCATION SOUTHSHOR...,NaN,NaN
4,pre2013_127580,20041021,2004,alameda,alameda,alameda,890,1.0,NaN,NaN,0,NaN,NaN,NaN,"$890 / 1br - Classy ""Painted Lady"" VICTORIAN -...",NaN,NaN

### üîß Try It Yourself ‚Äì Part 1

1. Add one line of code to print the number of rows and columns.

In [3]:
# Add code here üîß
print(f"Number of rows: {df.shape[0]}, Number of columns: {df.shape[1]}")

Number of rows: 200796, Number of columns: 17

## Part 2: Inspecting the Data

### Instructions:
- Identify missing values.
- Check data types are correct(e.g., dates, numeric columns).
- Check for outliers key numeric variables like `price`, `sqft`, `beds`, or `baths`. The concept of outliers will be covered more in week 6.  This week we will do only a very basic filter for outlier values.   

### Think about:
- Are there missing values?
- Do the data types look appropriate?

In [4]:
# Check for missing values
df.isnull().sum()

post_id             0
date                0
year                0
nhood               0
city                0
county           1394
price               0
beds             6608
baths          158121
sqft           136117
room_in_apt         0
address        196888
lat            193145
lon            196484
title            2517
descr          197542
details        192780
dtype: int64

In [5]:
# Basic summary statistics
df[['price', 'beds', 'baths', 'sqft']].describe()

               price           beds         baths           sqft
count  200796.000000  194188.000000  42675.000000   64679.000000
mean     2135.362746       1.889025      1.679086    1201.827688
std      1427.747903       1.079138      0.690509    5000.217864
min       220.000000       0.000000      1.000000      80.000000
25%      1295.000000       1.000000      1.000000     750.000000
50%      1800.000000       2.000000      2.000000    1000.000000
75%      2505.000000       3.000000      2.000000    1360.000000
max     40000.000000      12.000000      8.000000  900000.000000

In [6]:
# Check data types
df.dtypes

post_id         object
date             int64
year             int64
nhood           object
city            object
county          object
price            int64
beds           float64
baths          float64
sqft           float64
room_in_apt      int64
address         object
lat            float64
lon            float64
title           object
descr           object
details         object
dtype: object

### üîß Try It Yourself ‚Äì Part 2

1. Use `.describe()` to inspect the **square footage (`sqft`)**.

### In Your Response:
1. What patterns or issues do you see with square footage values? Is there anything unusual?

In [7]:
# Add code here üîß
df['sqft'].describe()

count     64679.000000
mean       1201.827688
std        5000.217864
min          80.000000
25%         750.000000
50%        1000.000000
75%        1360.000000
max      900000.000000
Name: sqft, dtype: float64

### ‚úçÔ∏è Your Response: üîß
1.

## Part 3: Basic Exploration

Use `groupby` and `value_counts` to summarize trends across neighborhoods and cities.  The concept of data exploration will be covered more in week 5.

In [8]:
# Average price by neighborhood
df.groupby('nhood')['price'].mean().sort_values(ascending=False).head(10)

nhood
inverness                     5310.000000
atherton                      4536.010989
tiburon / belvedere           4265.346591
financial district            3958.161417
west portal / forest hills    3827.276119
saratoga                      3801.850900
kentfield / ross              3611.577855
los altos                     3605.047072
SOMA / south beach            3585.900793
pacific heights               3487.850301
Name: price, dtype: float64

In [9]:
# Top cities by count
df['city'].value_counts().head(10)

city
san francisco    55730
san jose         13733
oakland           9443
santa rosa        6230
santa cruz        5464
san mateo         5127
sunnyvale         4526
mountain view     4414
berkeley          4201
santa clara       4171
Name: count, dtype: int64

### üîß Try It Yourself ‚Äì Part 3

Seek to understand the data by performing both of the following:

1. Group the listings by `year` and calculate the average price for each year.
2. Use `.value_counts()` on the `room_in_apt` column to see how common room rentals are.

### In Your Response:

1. Add a short comment or markdown cell describing any trends or insights you found.

In [10]:
# Add code here üîß
print("Average price by year:")
print(df.groupby('year')['price'].mean().sort_values(ascending=False))

print("\nRoom in apartment counts:")
print(df['room_in_apt'].value_counts())

Average price by year:
year
2015    3016.057967
2017    2998.658354
2018    2967.051076
2016    2892.953247
2014    2799.560424
2013    2679.816015
2007    2152.303178
2012    2126.308527
2011    2082.872963
2001    2070.038095
2008    2067.772489
2009    1951.866827
2010    1831.296377
2006    1822.992589
2002    1709.347079
2004    1640.209812
2003    1587.705745
2005    1525.475233
2000    1418.695652
Name: price, dtype: float64

Room in apartment counts:
room_in_apt
0    200511
1       285
Name: count, dtype: int64

Average Price by Year: Rental prices generally increased over the years, peaking around 2015-2018, with 2015 showing the highest average price and 2000 the lowest.
Room in Apartment Counts: The vast majority of listings are for entire apartments, with only a very small number representing single rooms within an apartment.

## Export Your Notebook to Submit in Canvas
- Use the instructions from Lab 1

In [ ]:
!jupyter nbconvert --to html "lab_04_data_understanding.ipynb"